#include <stdio.h>
#include <string.h>

union Common 
{
	int i;
	double pi;
	char str[20];
};

int main()
{
	union Common a,b,c;
	
	a.i = 211;
	a.pi = 3.1415926535123123;
	strcpy(a.str ,"c++ is the best language");
	
	printf("%p \n%p \n%p \n\n", &a.i ,&a.pi ,&a.str );
	printf("%d \n%.10f \n%s \n\n", a.i ,a.pi ,a.str );
	/*out:
	000000000062FE00
	000000000062FE00
	000000000062FE00

	539700067
	235566767350906220000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000.0000000000
	c++ is the best language
	*/
	
	//哈哈没有枚举 感觉有点憨憨 
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	return 0;
} 	
